__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            (None, None, 112, 11 0                                            
__________________________________________________________________________________________________
conv2D_0 (TimeDistributed)      (None, None, 112, 11 320         input_1[0][0]                    
__________________________________________________________________________________________________
maxpool_0 (TimeDistributed)     (None, None, 56, 56, 0           conv2D_0[0][0]                   
__________________________________________________________________________________________________
batchnorm_0 (TimeDistributed)   (None, None, 56, 56, 128         maxpool_0[0][0]                  
__________________________________________________________________________________________________
conv2D_1 (TimeDistributed)      (None, None, 56, 56, 9248        batchnorm_0[0][0]                
__________________________________________________________________________________________________
maxpool_1 (TimeDistributed)     (None, None, 28, 28, 0           conv2D_1[0][0]                   
__________________________________________________________________________________________________
batchnorm_1 (TimeDistributed)   (None, None, 28, 28, 128         maxpool_1[0][0]                  
__________________________________________________________________________________________________
conv2D_2 (TimeDistributed)      (None, None, 28, 28, 18496       batchnorm_1[0][0]                
__________________________________________________________________________________________________
maxpool_2 (TimeDistributed)     (None, None, 14, 14, 0           conv2D_2[0][0]                   
__________________________________________________________________________________________________
batchnorm_2 (TimeDistributed)   (None, None, 14, 14, 256         maxpool_2[0][0]                  
__________________________________________________________________________________________________
conv2D_3 (TimeDistributed)      (None, None, 14, 14, 73856       batchnorm_2[0][0]                
__________________________________________________________________________________________________
maxpool_3 (TimeDistributed)     (None, None, 7, 7, 1 0           conv2D_3[0][0]                   
__________________________________________________________________________________________________
batchnorm_3 (TimeDistributed)   (None, None, 7, 7, 1 512         maxpool_3[0][0]                  
__________________________________________________________________________________________________
flatten (TimeDistributed)       (None, None, 6272)   0           batchnorm_3[0][0]                
__________________________________________________________________________________________________
dropout (TimeDistributed)       (None, None, 6272)   0           flatten[0][0]                    
__________________________________________________________________________________________________
time_distributed (TimeDistribut (None, None, 1)      6273        dropout[0][0]                    
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, None)         0           time_distributed[0][0]           
__________________________________________________________________________________________________
softmax (Softmax)               (None, None)         0           flatten_1[0][0]                  
__________________________________________________________________________________________________
dot (Dot)                       (None, 6272)         0           dropout[0][0]                    
                                                                 softmax[0][0]                    
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1024)         6423552     dot[0][0]                        
__________________________________________________________________________________________________
dropout_1 (Dropout)             (None, 1024)         0           dense_1[0][0]                    
__________________________________________________________________________________________________
dense_2 (Dense)                 (None, 512)          524800      dropout_1[0][0]                  
__________________________________________________________________________________________________
dropout_2 (Dropout)             (None, 512)          0           dense_2[0][0]                    
__________________________________________________________________________________________________
dense_3 (Dense)                 (None, 2)            1026        dropout_2[0][0]                  
==================================================================================================
Total params: 7,058,595
Trainable params: 7,058,083
Non-trainable params: 512
__________________________________________________________________________________________________
