_________________________________________________________________
Layer (type)                 Output Shape              Param #   
=================================================================
input_1 (InputLayer)         (None, None, 112, 112, 1) 0         
_________________________________________________________________
conv2D_0 (TimeDistributed)   (None, None, 112, 112, 32 320       
_________________________________________________________________
maxpool_0 (TimeDistributed)  (None, None, 56, 56, 32)  0         
_________________________________________________________________
batchnorm_0 (TimeDistributed (None, None, 56, 56, 32)  128       
_________________________________________________________________
conv2D_1 (TimeDistributed)   (None, None, 56, 56, 32)  9248      
_________________________________________________________________
maxpool_1 (TimeDistributed)  (None, None, 28, 28, 32)  0         
_________________________________________________________________
batchnorm_1 (TimeDistributed (None, None, 28, 28, 32)  128       
_________________________________________________________________
conv2D_2 (TimeDistributed)   (None, None, 28, 28, 64)  18496     
_________________________________________________________________
maxpool_2 (TimeDistributed)  (None, None, 14, 14, 64)  0         
_________________________________________________________________
batchnorm_2 (TimeDistributed (None, None, 14, 14, 64)  256       
_________________________________________________________________
conv2D_3 (TimeDistributed)   (None, None, 14, 14, 128) 73856     
_________________________________________________________________
maxpool_3 (TimeDistributed)  (None, None, 7, 7, 128)   0         
_________________________________________________________________
batchnorm_3 (TimeDistributed (None, None, 7, 7, 128)   512       
_________________________________________________________________
flatten (TimeDistributed)    (None, None, 6272)        0         
_________________________________________________________________
dropout (TimeDistributed)    (None, None, 6272)        0         
_________________________________________________________________
cu_dnnlstm (CuDNNLSTM)       (None, None, 2048)        68173824  
_________________________________________________________________
lambda (Lambda)              (None, 2048)              0         
_________________________________________________________________
dense (Dense)                (None, 1024)              2098176   
_________________________________________________________________
dropout_1 (Dropout)          (None, 1024)              0         
_________________________________________________________________
dense_1 (Dense)              (None, 512)               524800    
_________________________________________________________________
dropout_2 (Dropout)          (None, 512)               0         
_________________________________________________________________
dense_2 (Dense)              (None, 2)                 1026      
=================================================================
Total params: 70,900,770
Trainable params: 70,900,258
Non-trainable params: 512
_________________________________________________________________
